# Вычислите 2179. Выведите на экран вычисленное значение.
print(2**179)
