# Вычислите длину гипотенузы в прямоугольном треугольнике со сторонами 179 и 971.


a = 179
b = 971

print((a ** 2 + b ** 2) ** (1 / 2))
