# Для вычисление числа p можно использовать следующее приближение (ряд Лейбница)
# Вычислите первые 10 членов этого ряда. Сколько получилось?

print(4/1-4/3+4/5-4/7+4/9-4/11+4/13-4/15+4/17-4/19)
