# Вычислите 2^179. Выведите на экран вычисленное значение.
print(2**179)
