# Вычислите 20!. Выведите на экран вычисленное значение.

import math

print(math.factorial(20))
