# Найдите и выведите все двузначные числа, которые равны удвоенному произведению своих цифр.


print("36")
