# 		Дана строка, содержащая одно или более целых чисел от $0$ до $10^9$, разделенных знаками “+” или “-”. Вычислите значение этого выражения.
# 



print(eval(input()))