# 		Дана строка, возможно, содержащая пробелы. Считайте эту строку и переведите все символы этой строки в нижний регистр. Решение оформите в виде функции ToLower (S), получающей в качестве параметра строку и возвращающую новую строку.
# 



def ToLower(s):
    return s.lower()


print(ToLower(input()))
