# 		Дана строка, состоящая из n цифр (т.е. однозначных чисел), между которыми стоит $n-1$ знак операции, каждый из которых может быть либо +, либо -. Вычислите значение данного выражения.
#  



print(eval(input()))