# Дано положительное действительное число X. Выведите его дробную часть.#  #    

from math import *

a = float(input())
print(a - int(a))