# Даны два целых числа. Выведите значение наибольшего из них.
#    



a = int(input())
b = int(input())

if a < b:
    print(b)
else:
    print(a)